
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES-CONNECTION-STRING
  * azurerm_key_vault_secret.POSTGRES_HOST
* Replace
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;scheduler_application&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-CONNECTION-STRING will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-CONNECTION-STRING" {
        id                      = "https://juror-stg.vault.azure.net/secrets/scheduler-api-POSTGRES-CONNECTION-STRING/4a45edb8c19445ac8474aaaf521ea6da"
        name                    = "scheduler-api-POSTGRES-CONNECTION-STRING"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://juror-stg.vault.azure.net/secrets/scheduler-api-POSTGRES-HOST/5b31b3c1f6aa418bbb44af7e5217a8ef"
        name                    = "scheduler-api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgres-expanded" # forces replacement
      ~ fqdn                          = "juror-scheduler-api-stg.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/juror-scheduler-api-stg" -> (known after apply)
        name                          = "juror-scheduler-api-stg"
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "application"         = "juror"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/juror-scheduler-api.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#juror-dev"
            "environment"         = "staging"
            "managedBy"           = "Juror"
        }
      - zone                          = "2" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/juror-scheduler-api-stg/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/juror-scheduler-api-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["scheduler_application"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/juror-scheduler-api-stg/databases/scheduler_application" -> (known after apply)
        name      = "scheduler_application"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/juror-scheduler-api-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Vars":{}} -->